{
  "main": {
    "name":"Hiren Mistry",
    "description":"Hi! I'm Hiren Mistry, a final year Computer Science Student at the University of Warwick.",
    "welcome":"Welcome to my Portfolio Website.",
    "image":"profilepic.jpg",
    "bio1": "My name is Hiren Mistry and I’m a final year Computer Science student at the University of Warwick.",
    "bio2": "I enjoy solving real life and commercial problems, finding fast and efficient solutions to complex challenges. I have experience in designing and developing programs in an array of languages, including Java, Python and HTML. Previous personal and university projects include web design, APIs, object-orientated programming and mobile applications.",
    "bio3": "Studying at the University of Warwick has strengthened my problem-solving skills and core understanding in order to produce high-quality algorithms and programs. Learning the fundamental principles of program design and information structures has ensured programs are fully optimized, with a fast user-experience.",
    "bio4": "I regularly keep up to date with the latest developments in Science and Technology and am passionate as to what the future of this developing field will bring to the world. I am an active member of the Warwick Trading Society and have taken part in various trading events.",
    "bio5" : "Aside from software development, I regularly play Badminton and Basketball both competitively and socially and am a proud member of the Warwick Badminton Society. I am also the Technology executive at the Warwick Congress Society.",
    "contactmessage":"If you have any questions, please feel free to get in touch!",
    "phone": "555-555-5555",
    "github":"https://github.com/nordicgiant2/react-nice-resume",
    "project":"https://github.com/nordicgiant2/react-nice-resume",
    "address":{
      "street":"(Your Street)",
      "city":"(Your City)",
      "state":"(Your State)",
      "zip": "(Your Zip/Postal Code)"
    },
    "website": "http://www.hirenmsitry.com",
    "resumedownload":"http://timbakerdev.com",
    "social":[

      {
        "name":"linkedin",
        "url":"https://www.linkedin.com/in/hiren-mistry17/",
        "className":"fa fa-linkedin"
      },
      {
        "name":"instagram",
        "url":"https://www.instagram.com/hiren_mistry17/",
        "className":"fa fa-instagram"
      },
      {
        "name":"github",
        "url":"https://github.com/HirenRMistry",
        "className":"fa fa-github"
      },
      {
        "name":"email",
        "url":"mailto:contact@hirenmistry.co.uk",
        "className":"fa fa-envelope"
      },
      {
        "name":"Tes Shop",
        "url":"https://www.tes.com/teaching-resources/shop/hiren2017",
        "className":"fa fa-book"
      }

    ]
  },
  "resume":{
    "skillmessage":"Here are some of my skills and their proficiency. Click on a project name for more infomation.",
    "education":[
      {
        "school":"University?",
        "degree":"Masters in Beer tasting",
        "graduated":"April 2007",
        "description":"Describe your experience at school, what you learned, what useful skills you have acquired etc."
      },
      {
        "school":"School #1 Maybe College?",
        "degree":"What did you study 101",
        "graduated":"March 2003",
        "description":"Describe your experience at school, what you learned, what useful skills you have acquired etc."
      }
    ],
    "work":[
      {
        "company":"Awesome Design Studio",
        "title":"Senior UX God ",
        "years":"March 2010 - Present",
        "description":"Describe work, special projects, notable achievements, what technologies you have been working with, and anything else that would be useful for an employer to know."
      },
      {
        "company":"Super Cool Studio",
        "title":"Junior bug fixer",
        "years":"March 2007 - February 2010",
        "description":"Describe work, special projects, notable achievements, what technologies you have been working with, and anything else that would be useful for an employer to know."
      }
    ],
    "skills":[
      {
        "name":"Java",
        "level":"80%"
      },
      {
        "name":"Python",
        "level":"80%"
      },
      {
        "name":"SQL",
        "level":"80%"
      },
      {
        "name":"JavaScript",
        "level":"80%"
      },
      {
        "name":"HTML",
        "level":"80%"
      },
      {
        "name":"CSS",
        "level":"80%"
      },
      {
        "name":"ReactJS",
        "level":"70%"
      },
      {
        "name":"C",
        "level":"70%"
      },
      {
        "name":"Haskell",
        "level":"60%"
      },
      {
        "name":"Bash",
        "level":"60%"
      },
      {
        "name":"MatLab",
        "level":"60%"
      },
      {
        "name":"Android Studio",
        "level":"50%"
      }
    ]
  },
  "portfolio":{
    "projects": [
      {
        "title":"Portfolio Website (V2)",
        "date": "July 2020",
        "category":"Personal Project",
        "one_line": "A React based Portfolio Website",
        "tags" : ["ReactJS", "HTML", "CSS", "Personal", "JavaScript"],
        "image":"portfolioWebsiteV2master.jpg",
        "github": true,
        "url":"https://github.com/HirenRMistry/PortfolioV2"
      },
      {
        "title":"Angular Weather App",
        "date": "June 2020",
        "category":"Personal Project",
        "one_line": "An Angular Based Weather App which uses the OpenWeather API to fetch weather data. Includes unit tests.",
        "tags" : ["Angular", "HTML", "CSS", "Personal", "JavaScript"],
        "image":"angularweatherapp.jpg",
        "github": true,
        "url":"https://github.com/HirenRMistry/angular-test"
      },
      {
        "title":"Derivative Trade Reporting & Analytical Tool",
        "date": "March 2020",
        "category":"Module: CS261 – Software Engineering",
        "one_line":"A tool which uses machine learning to analyse and report derivative trade data. Part of 2nd Year Group Project.",
        "info":[
          "In this group project (Sponsored by Deutsche Bank), we were tasked with creating a derivative trade reporting and analytical tool.",
          "Our project was able to add, edit and delete derivate trade and currency data, in additon to using Machine Learning to find ‘fat-finger’ errors and other inconsistencies in the data over time.",
          "For this project, we used Python with the Flask Web framework along in combination with isolation forest used in the machine learning."
        ],
        "tags" : ["Flask", "Year2", "Python", "Deutsche Bank"],
        "image":"cs261Trade.jpg",
        "github": false,
        "url":""
      },
      {
        "title":"Timetable Scheduler",
        "date": "January 2020",
        "category":"Module: CS255 – Artificial Intelligence",
        "one_line":"Given a list of modules, tutors & constraints this project uses a backtracking algorithm to produce an accepted timetable.",
        "info":[
          "In this project, I created a Timetable Scheduler which will schedule a given a set of modules and lab sessions on weekdays with a given number of slots, ensuring the sessions are scheduled in the most cost-effective way.",
          "This is an example of a solution to a constraint satisfaction problem and uses backtracking in addition to a MRV ordering heuristic to find the best solution."
        ],
        "tags" : ["Artificial Intellgence", "Year2", "Python"],
        "image":"timetablescheduler.jpg",
        "url":""
      },
      {
        "title":"Multi-Threaded Packet Sniffer",
        "date": "December 2019",
        "category":"Module: CS241 – Computer Networks & Operating Systems",
        "one_line":"A Packet sniffer which detects & analyses Ethernet, ARP, IPv4 and TCP packets whilst detecting intrusions such as SYN, ARP poisoning attacks and blacklisted URLs.",
        "info": [
          "In this task, I created a Packet sniffer that can detect and analyse Ethernet, ARP, IPv4 and TCP packets written in C. In addition, the program can also detect intrusions such as: SYN attacks, ARP poisoning and blacklisted URLs.",
          "Packets are analysed concurrently using a thread pool with a maximum of 10 threads."
        ],
        "tags" : ["C", "HTML", "Year2"],
        "image":"packetsniffer.jpg",
        "url":""
      },
      {
        "title":"Department Store Database Analysis",
        "date": "December 2019",
        "category":"Module: CS258 – Database Systems",
        "one_line": "A Database System for a fictional department store, able to store the inventory, orders, collections, deliveries and staff.",
        "info": [
          "In this task, I created a database system for a department store that stores the inventory, orders, collections, deliveries and staff.",
          "Using JDBC, the system allows staff to create in-store purchases, collections and deliveries, review the biggest selling products, calculate staff life-time success, staff contribution and candidates for employee of the year all using SQL queries.",
          "Input is carefully sanitised and validated before the SQL query is constructed."
        ],
        "tags" : ["SQL", "Java", "Year2"],
        "image":"databases.jpg",
        "url":""
      },
      {
        "title":"Scratch Clone",
        "date": "March 2019",
        "category":"Module: CS141 - Functional Programming",
        "one_line":"A project which evaluates statements & instructions and updates and returns the state to user. Uses Haskell - Functional Programming Language.",
        "info": [
          "This project involved writing a program in the functional programming language Haskell which evaluates statements and instructions, depending on the given state.",
          "The program then updates and returns the state to user. Input included assignment, if statements and instructions to retrieve data from memory.",
          "Additional functionality I implemented included while statements, repeat statements, Booleans and the factorial function."
        ],
        "tags" : ["Haskell", "Functional", "Year1"],
        "image":"scratchclone.jpg",
        "url":""
      },
      {
        "title":"Mastermind",
        "date": "February 2019",
        "category":"Module: CS141 - Functional Programming",
        "one_line":"An implementation of Donald Knuth's Algorithm for the familiar Mastermind Game. Written in Haskell.",
        "info": [
          "This project involved writing specific functions in the Haskell to implement Donald Knuth's algorithm in the Mastermind game.",
          "This algorithm has the ability to solve any four character codes in under 5 guesses."
        ],
        "tags" : ["Haskell", "Functional", "Year1"],
        "image":"mastermind.jpg",
        "url":""
      },
      {
        "title":"Witter",
        "date": "March 2019",
        "category":"Module: CS126 - Design of Information Structures",
        "one_line": "A project which simulates the functionality of Twitter and involved storing and retrieving users, ‘Weets’, and followers. Hash tables and adjacency matrices were used to store and retrieve the data, ensuring a fast and efficient process.",

        "info": [
          "This project simulated the basic functionality of Twitter and involved storing and retrieving users, ‘Weets’, and followers. ",
          "Hash tables and adjacency matrices were used to store and retrieve the data, ensuring a fast and efficient process."
        ],
        "tags" : ["Java", "Year1"],
        "image":"noimage.jpg",
        "url":""
      },
      {
        "title":"Maze 2",
        "date": "December 2018",
        "category":"Module: CS118 - Programming for Computer Scientists",
        "one_line":"This task built on Maze 1 and required the robot to carry out a depth-first search in order to find the target. A stack was used to allow the robot to efficiently backtrack and find a correct route.",
        "info": [
          "This task built on Maze 1 and required the robot to carry out a depth-first search in order to find the target.",
          "I used a stack to allow the robot to efficiently backtrack and find a correct route.",
          "After the depth-first search, the robot is able to use the stack to navigate a clear route to the target.",
          "As an additional feature, I created a program which allowed the user to control the robot using a keyboard."
        ],
        "tags" : ["Java", "DFS", "Year1"],
        "image":"maze2.jpg",
        "url":""
      },
      {
        "title":"Maze 1",
        "date": "October 2018",
        "category":"Module: CS118 - Programming for Computer Scientists",
        "one_line": "This project allows a robot to navigate through a randomly generated maze. The robot needed to avoid crashing into walls and pick the correct route to move towards the target.",
        "info": [
          "In this project, I had to write a program in Java to navigate a robot through a randomly generated maze. ",
          "The robot needed to avoid crashing into walls and pick the correct route to move towards the target. ",
          "In the event multiple moves made the robot move towards the target, a random move was chosen."
        ],
        "tags" : ["Java", "DFS", "Year1"],
        "image":"maze1.jpg",
        "url":""
      },
      {
        "title":"Tic Tac Toe",
        "date": "May 2018",
        "category":"Personal",
        "one_line": "A implementaion of the familiar game 'Noughts & Crosses' as an Android App. ",
        "info": [
          "In this project, I created the familiar game Tic TacToe in Android Studio using Java. ",
          "The app allows two users to play the game, alert the winner of the game, keep score of the game and allows the game to be reset. ",
          "As my first project using Android Studio, this task was mainly to improve my basic Java skills and produce a Android APK."
        ],
        "tags" : ["Java", "Android Studio", "Personal"],
        "image":"tictactoe.jpg",
        "url":""
      },
      {
        "title":"Nuffield Foundation Placement",
        "date": "August 2017",
        "category":"Internship",
        "one_line":"A Research Placement by the Nuffield Foundation and the University of Northampton. My research involved learning how to use a Robot Arm using Python & developing a set of task for younger students to learn about programming.",
        "info": [
          "During the Summer, I took part in a Nuffield Foundation Research Placement, where I had to program a Robot Arm to carry out various movements in Python and designed an interactive set of tasks for younger students to learn about programming using this Robot Arm.",
          "Furthermore, I had to plan, prepare and deliver a presentation and report about my research project to a selection of Computer Science experts, which further developed my communication skills and self-confidence.",
          " received the Gold CREST Award for my research into Robotics."
        ],
        "tags" : ["Python", "Robot Arm", "Internship"],
        "image":"noimage.jpg",
        "url":""
      }


    ]
  }
}
